[
    {
        "rule": "NSFW content is not allowed",
        "description_lines": [
            "NSFW is strictly forbidden in all of its forms. Do not attempt to bypass this requirement.",
            "We are an open and welcoming community, that targets a varied age range, and we want to keep a safe environment for everyone here.",
            "You may read the [Cornell Law website](https://www.law.cornell.edu/uscode/text/18/2256) for legal information"
        ]
    },
    {
        "rule": "This is not a dating server",
        "description_lines": [
            "Do not hit on people (even accidentally). This server is open to minors, and we can't",
            "verify anyone's age, so we have to treat all instances as potential interaction with a minor, regardless of how old",
            "anyone says they are. As an adult, you should be mature, use common sense, and avoid interactions with minors in any form that involves dating or similar.",
            "If you're a minor, this also applies for the reasons mentioned beforehand. Do not engage in such activities for your own safety.",
            "By extension, think before you type."
        ]
    },
    {
        "rule": "Hateful speech towards others",
        "description_lines": [
            "Hateful speech is not allowed in any form. You are allowed to have your own opinion, but it must follow the widely accepted standards of society. Respect to be respected."
        ]
    },
    {
        "rule": "Spam in the general chats",
        "description_lines": [
            "Media with loud sounds or inappropriate content may be removed. By extension, low effort trolling content is forbidden."
        ]
    },
    {
        "rule": "Piracy",
        "description_lines": [
            "Discussions regarding piracy is allowed, but it must comply with Discord ToS.",
            "You may not share the sources or link to pirated content, in any form."
        ]
    },
    {
        "rule": "Support Rules",
        "description_lines": [
            "Tech support regarding Arch Linux, Linux and related is provided as is, and should be accessible to anyone in the community.",
            "You are entitled to help others that may require assistance.",
            "You are not \"owed\" help. People have their own lives, hence they're helping voluntarily, and you must therefore respect their free time.",
            "You may not ping others that do not want to help you.",
            "You may link your issue thread, but do not spam it in other channels.",
            "Trolling, malicious behaviour, and/or shitposting in the support channels is forbidden.",
            "You may not provide or ask for remote support via SSH, Anydesk, Teamviewer or any other form. By extension, you may not take support to DMs."
        ]
    }
]